app/Http/Controllers/PlanningOverallInformationController.php

select * from `language`
select * from `study_type`
select * from `project_languages` where `id_project` = '1'
select * from `project_study_types` where `id_project` = '1'
select * from `domain` where `id_project` = '1'
select * from `keyword` where `id_project` = '1'
---
    public function index(string $id_project)
    {
        $project = Project::findOrFail($id_project);
        $usersRelation = $project->users()->get();
        $languages = Language::all();
        $databases = Database::all();
        $studyTypes = StudyType::all();
        $activeTab = 'overall-info';
        $projectLanguages = ProjectLanguage::where('id_project', $id_project)->get();
        $projectDatabases = ProjectDatabase::where('id_project', $id_project)->get();
        $projectStudyTypes = ProjectStudyType::where('id_project', $id_project)->get();
        $domains = Domain::where('id_project', $id_project)->get();
        $keywords = Keyword::where('id_project', $id_project)->get();

insert into `domain` (`id_project`, `description`) values ('1', '1341413')
---
    public function domainUpdate(Request $request)
    {
        $activeTab = 'overall-info';
        $this->validate($request, [
            'description' => 'required|string',
        ]);

        $domain = Domain::create([
            'id_project' => $request->id_project,
            'description' => $request->description,
        ]);